Revit 2027 API
View.EnableRevealHiddenMode Method
 Enables Reveal Hidden elements mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void EnableRevealHiddenMode()
Public Sub EnableRevealHiddenMode
public:
void EnableRevealHiddenMode()
member EnableRevealHiddenMode : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  View cannot use temporary visibility modes.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace